<!DOCTYPE html>
<html>
<head>
   <title>
     Deutsche AutoHotkey Community
   </title>
   <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   <meta name="description" content="Freie Scriptsprache. Unterst&uuml;tzt Hotkeys f&uuml;r Tastatur, Maus und Joystick. Kann Abk&uuml;rzungen bei Benutzereingabe erweitern (Auto-Text).">
   <meta name="keywords" content="Maus,Automatisierung,Tastatur,Makro,Tastaturk&uuml;rzel,Hotkey,Download,Script,Zwischenablage,RSI,Taste,Tastatureingabe,AutoText,klicken,dr&uuml;cken,Lautst&auml;rke,Stummschalten,neubelegen,Remapper,programmieren,senden">
   <link rel="shortcut icon" href="images/favicon.gif">
   <link rel="alternate" type="application/rss+xml" title="AutoHotkey Forum RSS" href="forum/rss.php">
   <link rel="stylesheet" href="docs/css/default.css" type="text/css">
   <script type="text/javascript">
var _gaq = _gaq || [];
   _gaq.push(['_setAccount', 'UA-28224374-1']);
   _gaq.push(['_trackPageview']);

   (function() {
     var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
     ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
     var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
   })();
   </script>
 </head>
 <body>
   <div id="wrapper">
     <div id="header">
       <table class="header">
         <tbody>
           <tr>
             <td>
               <a href="index.htm"><img src="images/AutoHotkey_logo.gif" alt="Automation. Hotkeys. Scripting."></a>
             </td>
             <td style="border-right: 1px solid #999999;">
               <table class="nav">
                 <tbody>
                   <tr>
                     <th colspan="2" style="border-bottom: 1px solid #999999;">
                       <img src="images/DE.gif" title="Deutsch" alt=""> Deutsche Community
                     </th>
                   </tr>
                   <tr>
                     <td>
                       <a href="download/index.htm">Download</a>
                     </td>
                     <td>
                       <a href="docs/Tutorial.htm">Erste Schritte</a>
                     </td>
                   </tr>
                   <tr>
                     <td>
                       <a href="docs/Overview.htm">Dokumentation</a>
                     </td>
                     <td>
                       <a href="support/index.htm">Support</a>
                     </td>
                   </tr>
                   <tr>
                     <td>
                       <a href="docs/AHKL_ChangeLog.htm">Changelog</a>
                     </td>
                     <td>
                       <a href="forum/">Forum</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="wiki/">Wiki</a>
                     </td>
                   </tr>
                 </tbody>
               </table>
             </td>
             <td>
               <table class="nav">
                 <tbody>
                   <tr>
                     <th>
                       <a href="http://www.autohotkey.com/"><img src="images/USUK.gif" alt="English" title="Englisch"></a> <a href="http://cn.autohotkey.com/"><img src="images/CH.gif" alt="Chinese" title="Chinesisch"></a> <a href="http://autohotkey.free.fr/docs/"><img src="images/FR.gif" alt="French" title="Franz&ouml;sisch"></a> <a href="http://www.script-coding.com/AutoHotkeyTranslation.html"><img src="images/RS.gif" alt="Russian" title="Russisch"></a> <a href="http://insomnia.gr/vb3/showthread.php?t=176244"><img src="images/GR.gif" alt="Greek" title="Griechisch"></a> <a href="http://www.autohotkey.com/docs/Tutorial-Portuguese.html"><img src="images/PO.gif" alt="Portuguese" title="Portugiesisch"></a> <a href="http://cafe.naver.com/AutoHotKey"><img src="images/KR.gif" alt="Korean" title="Koreanisch"></a> <a href="http://lukewarm.s101.xrea.com/"><img src="images/JA.gif" alt="Japanese" title="Japanisch"></a>
                     </th>
                   </tr>
                   <tr>
                     <td style="vertical-align: bottom;">
                       <form method="get" action="http://www.google.com/search">
                         <table>
                           <tbody>
                             <tr>
                               <td colspan="2">
                                 <input name="q" size="30" value="" type="text">
                               </td>
                             </tr>
                             <tr>
                               <td>
                                 <select name="sitesearch">
                                   <option value="de.autohotkey.com" selected="selected">
                                     Alles
                                   </option>
                                   <option value="de.autohotkey.com/docs">
                                     Dokumentation
                                   </option>
                                   <option value="de.autohotkey.com/forum">
                                     Forum
                                   </option>
                                 </select>
                               </td>
                               <td style="text-align: right;">
                                 <input value="Suchen" type="submit">
                               </td>
                             </tr>
                           </tbody>
                         </table>
                       </form>
                     </td>
                   </tr>
                 </tbody>
               </table>
             </td>
           </tr>
         </tbody>
       </table>
     </div>
     <div id="content">
       <h2>
         Neuigkeiten
       </h2>
       <table class="news">
         <tbody>
           <tr>
             <td>
               31.12.2011
             </td>
             <td>
               AutoHotkey_L Version 1.1.05.06: <a href="docs/AHKL_ChangeLog.htm">Changelog</a> | <a href="download/index.htm">Download</a>
             </td>
           </tr>
           <tr>
             <td>
               07.04.2011
             </td>
             <td>
               Ver&ouml;ffentlichung von AutoHotkey v2 Alpha: F&uuml;r Details siehe <a href="http://www.autohotkey.com/forum/topic70266.html">Forumsbeitrag von Lexikos</a>.
             </td>
           </tr>
         </tbody>
       </table>
       <h2>
         Einleitung
       </h2>
       <p>
         <strong>AutoHotkey</strong> ist eine frei verf&uuml;gbare Open-Source-Scriptsprache f&uuml;r Windows. Als <a href="http://de.wikipedia.org/wiki/Strukturierte_Programmierung">strukturierte Programmiersprache</a> umfasst diese folgende Funktionen:
       </p>
       <ul>
         <li>Automatisieren von allt&auml;glichen Aufgaben durch Senden von k&uuml;nstlichen Tastatureingaben und Mausklicks. <a href="docs/misc/Macros.htm">Maus- oder Tastaturmakros</a> k&ouml;nnen entweder manuell oder mithilfe des Makrorecorders erstellt werden.
         </li>
         <li>Erstellen von <a href="docs/Hotkeys.htm">Hotkeys</a> f&uuml;r Tastatur, Maus und Joystick. Praktisch jede Taste, Maustaste oder Tastenkombination kann ein Hotkey werden.
         </li>
         <li>
           <a href="docs/Hotstrings.htm">Erweitern von Abk&uuml;rzungen</a> bei Benutzereingabe. Zum Beispiel w&uuml;rde das Wort "bzw" automatisch mit "beziehungsweise" ersetzt, sobald es eingegeben wird.
         </li>
         <li>Erstellen von benutzerdefinierten Eingabeformularen und Men&uuml;leisten. Mehr Informationen k&ouml;nnen unter <a href="docs/commands/Gui.htm">GUI</a> gefunden werden.
         </li>
         <li>
           <a href="docs/misc/Remap.htm">Neubelegen</a> von Tastatur-, Maus- oder Joystick-Tasten.
         </li>
         <li>Verarbeitung von Dateien, Strings, Fenster und der Registrierung.
         </li>
         <li>Umwandeln eines Scripts in eine <a href="docs/Scripts.htm#ahk2exe">EXE-Datei</a>. Diese Datei kann von Benutzern verwendet werden, die kein AutoHotkey installiert haben.
         </li>
         <li>Erkennung komplizierter Stringmuster mithilfe von <a href="docs/misc/RegEx-QuickRef.htm">Regul&auml;ren Ausdr&uuml;cken</a>.
         </li>
         <li>Zugriff auf API-Funktionen von Windows und anderen Programmen mittels <a href="docs/commands/DllCall.htm">DllCall</a>.
         </li>
         <li>
           <a href="docs/commands/PostMessage.htm">Senden</a> oder <a href="docs/commands/OnMessage.htm">Abfangen</a> von Fensternachrichten.
         </li>
       </ul>
       <p>
         Der Einstieg ist einfacher, als ihr denkt. Schaut euch dazu die <a href="docs/Tutorial.htm">Ersten Schritte</a> an.
       </p>
       <p>
         <strong>AutoHotkey_L</strong> (empfohlen) ist eine benutzerdefinierte Version von AutoHotkey, die von <a href="http://www.autohotkey.com/forum/profile.php?mode=viewprofile&amp;u=3754">Lexikos</a> verwaltet wird. Zus&auml;tzlich zu den oben genannten Funktionen sind folgende enthalten (kompletter Funktionsumfang kann <a href="docs/AHKL_Features.htm">hier</a> eingesehen werden):
       </p>
       <ul>
         <li>
           <a href="docs/Objects.htm">Objekte</a> (erweiterbare assoziative Arrays)
         </li>
         <li>Interaktive <a href="docs/Scripts.htm#idebug">Debug-Funktionen</a> beim Verwenden eines kompatiblen Debug-Clients.
         </li>
         <li>Unterst&uuml;tzung von 64-Bit, COM, Unicode und unterschiedlichen Textkodierungen.
         </li>
         <li>Neue Argumenttypen f&uuml;r DllCall.
         </li>
         <li>Objekt-orientierte Dateibearbeitung.
         </li>
         <li>
           <a href="docs/commands/_If.htm">#If Ausdruck</a> - Vergleichbar mit <a href="docs/commands/_IfWinActive.htm">#IfWinActive</a>, aber f&uuml;r beliebige Ausdr&uuml;cke.
         </li>
         <li>Interne Unterst&uuml;tzung f&uuml;r <a href="docs/commands/Menu.htm#MenuIcon">Men&uuml;-Icons</a> und Verbesserungen der <a href="docs/AHKL_Features.htm#icons">Icon-Unterst&uuml;tzung</a>.
         </li>
       </ul>
       <p>
         <strong>AutoHotkey v2</strong> ist eine Verzweigung von AutoHotkey_L, die dazu dient, die Benutzerfreundlichkeit und den Komfort der Sprache und des Befehlssatzes zu verbessern, ohne dabei die Abw&auml;rtskompatibilit&auml;t zu beachten. Die Entwicklung dieser Version befindet sich zurzeit im Alpha-Status. Das hei&szlig;t, dass weitere &Auml;nderungen kommen werden, die die Kompatibilit&auml;t beeinflussen.
       </p>
       <h2>
         Mehr &uuml;ber Hotkeys und Hotstrings
       </h2>
       <p>
         Ein <a href="docs/Hotkeys.htm">Hotkey</a> ist eine Taste bzw. Tastenkombination, durch die eine ihr zugewiesene Aktion ausgel&ouml;st wird. AutoHotkey setzt das volle Potential von Tastatur, Joystick und Maus frei: Zus&auml;tzlich zu den typischen Modifikatortasten wie Steuerung, Alt und Umschalt lassen sich auch die Windows- und die Feststelltaste als solche verwenden - wirklich jede Taste. Zu dieser und anderen M&ouml;glichkeiten siehe unter <a href="docs/HotkeyFeatures.htm">Erweiterte Hotkey-Funktionen</a>.
       </p>
       <p>
         Bei einem <a href="docs/Hotstrings.htm">Hotstring</a> wird die Aktion ausgef&uuml;hrt, sobald der Benutzer eine bestimmte Zeichenfolge eingegeben hat. Meist verwendet man Hotstrings, um beim Schreiben Zeit zu sparen: L&auml;ngere, oft wiederkehrende Standardformulierungen l&auml;sst man von AutoHotkey schreiben, indem man kurze - vorher definierte - Zeichenfolgen eingibt.
       </p>
       <h2>
         Foren
       </h2>
       <p>
         Die vielen lokalen AutoHotkey-Communities, die in den letzten Jahren entstanden sind, belegen die wachsende Beliebtheit von AutoHotkey. Neben der <a href="http://www.autohotkey.com">Originalseite</a> und der deutschen Seite, auf der Sie sich gerade befinden, gibt es noch Ableger in franz&ouml;sisch, russisch, japanisch, griechisch, portugiesisch, koreanisch und chinesisch. Die meisten unterhalten eigene Foren, die auch intensiv genutzt werden.
       </p>
       <p>
         Die Foren sind eine Fundgrube f&uuml;r Tipps und Tricks, mit kleinen und auch umfangreichen Scripts f&uuml;r die unterschiedlichsten Anwendungen. Die Palette der Teilnehmer reicht vom "blutigen" Anf&auml;nger bis zum Profi. Ob Sie mit einem Script mal nicht weiterkommen, Fragen oder Anregungen haben, evtl. eigene Scripts vorstellen m&ouml;chten oder einfach nur "quatschen" wollen - seien Sie herzlich willkommen!
       </p>
       <h2>
         Was andere sagen
       </h2>
       <p>
         <strong>kick-image WEBDESIGN | PRINTDESIGN:</strong> Eines dieser Tools, welches uns schon sehr ans Herz gewachsen ist, nennt sich AutoHotkey. [...] Eine Zeitersparnis und ein Komfort den wir nicht mehr missen wollen! [<em>Kompletter Weblog: <a href="http://www.kick-image.at/weblog/17-04-2008/autohotkey">AutoHotkey Tastaturkommandos</a></em>]
       </p>
       <p>
         <strong>BBC News:</strong> Bei regelm&auml;&szlig;iger Computernutzung ist das RSI-Syndrom eine h&auml;ufige Erkrankung. [...] Durch Scripts, die f&uuml;r Sie so ziemlich alle regelm&auml;&szlig;igen Arbeiten machen, sch&uuml;tzen Sie sich nicht nur vor dem RSI-Syndrom, sondern k&ouml;nnen auch noch wertvolle Zeit sparen. [<em>Kompletter Video-Clip: <a href="http://news.bbc.co.uk/2/hi/programmes/click_online/7858345.stm">AutoHotKey</a></em>]
       </p>
       <p>
         <strong>Heise Software-Verzeichnis:</strong> Belegt (Funktions-)Tasten mit beliebigen Befehlen, zeichnet Makros auf, kompiliert sie auf Wunsch in ausf&uuml;hrbare Programme, ersetzt Abk&uuml;rzungen gegen l&auml;ngere Texte [<em>Kompletter Artikel: <a href="http://www.heise.de/software/download/autohotkey/20763">AutoHotKey 1.0.48.00</a></em>]
       </p>
       <p>
         <strong>Michael Sonntag, blumenstrasse:</strong> Dieser Artikel liegt mir schon lange auf dem Herzen, weil ich Autohotkey ziemlich genial finde und seit rund einem dreiviertel Jahr benutze. [<em>Kompletter Artikel: <a href="http://www.littlecompany.de/kleine-einfuehrung-in-autohotkey-mit-beispielen.html">Kleine Einf&uuml;hrung in Autohotkey (mit Beispielen)</a></em>]
       </p>
       <p>
         <strong>B&auml;rbel Schmidt, PC-Welt:</strong> Auto Hotkey setzt der eigenen Kreativit&auml;t kaum Grenzen. Ein Druck auf eine der Funktionstasten kann Windows etwa dazu veranlassen, mehrere Browser mit bestimmten Seiten zu &ouml;ffnen und zus&auml;tzlich einige Programme zu starten und bestimmte Funktionen aufzurufen. Das alles erledigen Sie mit Hilfe einfacher AHK-Scriptbefehle, die Sie in der Online-Hilfe oder im Netz auf der gut gemachten deutschsprachigen Site finden. [<em>Kompletter Artikel: <a href="http://www.pcwelt.de/start/software_os/systemtools/praxis/189074/windows_vollautomatisch/">Ratgeber: Windows vollautomatisch</a></em>]
       </p>
       <p>
         <strong>Total Commander Wiki:</strong> Das zentrale Anliegen des Programms ist, wie schon der Name verr&auml;t, Hotkeys oder wie man in deutsch sagt Tastaturk&uuml;rzel. Diese lassen sich mit Autohotkey sehr schnell erstellen. Ein weiteres gro&szlig;artiges Feature, welches man im Programm AutoIt vermisst, sind Hotstrings. [<em>Siehe: <a href="http://www.ghisler.ch/wikide/index.php/AutoHotkey">Wiki: AutoHotkey</a></em>]
       </p>
       <p>
         <strong>David A. Karp von PCMAG.COM:</strong> Das Sch&ouml;ne an AutoHotkey ist, da&szlig; es &uuml;berall benutzt werden kann. Wenn Sie in Gmail, Excel, Photoshop und World of Warcraft dieselben Tastenk&uuml;rzel benutzen k&ouml;nnen, kann dies die Zeit f&uuml;r das Schreiben eines oder zweier Makros aufwiegen. [<em>Kompletter Artikel: <a href="http://www.pcmag.com/article2/0,2817,2328732,00.asp">Program Your Own Keyboard Shortcuts</a></em>]
       </p>
       <p>
         <strong>CHIP Online:</strong> Das hilfreiche Gratis-Tool f&uuml;gt h&auml;ufig verwendete Textbausteine in jede beliebige Anwendung, sobald Sie eine vorher festgelegte Abk&uuml;rzung oder Tastenkombination eintippen. [<em>Kompletter Artikel: <a href="http://www.chip.de/downloads/AutoHotkey-1.0.47_13653378.html">AutoHotkey</a></em>]
       </p>
       <p>
         <strong>Greg Steen</strong> w&uuml;rdigt AutoHotkey im Microsoft TechNet Magazine. [<em>Kompletter Artikel (englisch): <a href="http://technet.microsoft.com/en-us/magazine/cc194395.aspx">Automate Tasks - AutoHotkey</a></em>]
       </p>
       <p>
         <strong>Wolfgang Reszel von c't</strong>: Das Open-Source-Tool AutoHotkey schickt gleich mehrere Tools in den Ruhestand. Es vereint Hotkey- und Textbausteinfunktionen in sich, bietet eine Skriptsprache, die m&auml;chtiger ist als jede Batchdatei und leichter zu programmieren als der Windows Script Host. Anf&auml;nger kommen dank Basic-&auml;hnlichem Dialekt, Makrorecorder und Syntax-Check schnell zurecht. [<em>Kompletter Artikel: <a href="http://www.heise.de/kiosk/archiv/ct/2005/3/196">Windows und Programme einfach automatisieren</a></em>]
       </p>
       <p>
         <strong>Adam Pash von Lifehacker</strong>: Ich bin davon &uuml;berzeugt, da&szlig; ich mit AutoHotkey die Zeit f&uuml;r das Beantworten von E-Mails auf ein Drittel reduziert habe. [<em>Kompletter Artikel (englisch): <a href="http://www.lifehacker.com/software/keyboard-shortcuts/hack-attack-knock-down-repetitive-email-with-autohotkey-159785.php">Knock down repetitive email with AutoHotKey</a></em>]
       </p>
       <h2>
         Weitere Eigenschaften
       </h2>
       <ul class="small">
         <li>&Auml;ndern Sie Lautst&auml;rke, Muting (Stummschaltung) und andere <a href="docs/commands/SoundSet.htm">Einstellungen</a> bei jeder Soundkarte.
         </li>
         <li>Machen Sie ein Fenster <a href="docs/commands/WinSet.htm#trans">transparent</a>, bringen Sie es <a href="docs/commands/WinSet.htm#AlwaysOnTop">dauerhaft in den Vordergrund</a>, oder &auml;ndern Sie seine <a href="docs/commands/WinSet.htm#region">Form</a>.
         </li>
         <li>Benutzen Sie einfach einen <a href="docs/scripts/JoystickMouse.htm">Joystick</a> oder die <a href="docs/scripts/NumpadMouse.htm">Tastatur</a> als Maus.
         </li>
         <li>
           <a href="docs/commands/SetTimer.htm">&Uuml;berwachen</a> Sie Ihr System. Lassen Sie z. B. unerw&uuml;nschte Fenster automatisch schlie&szlig;en, sobald sie auftauchen.
         </li>
         <li>Lesen und &auml;ndern Sie den <a href="docs/misc/Clipboard.htm">Inhalt der Zwischenablage</a>, z. B. auch Dateinamen, die vom Explorer-Fenster kopiert wurden.
         </li>
         <li>
           <a href="docs/misc/Override.htm">Sperren oder &uuml;berschreiben</a> Sie Windows-eigene Tastaturk&uuml;rzel wie Win+E und Win+R.
         </li>
         <li>Lindern Sie das RSI-Syndrom (Mausarm) durch Ersetzungen f&uuml;r <a href="docs/Hotkeys.htm#alttab">Alt-Tab</a> (durch Tasten, Mausrad oder Maustasten).
         </li>
         <li>Richten Sie sich das <a href="docs/commands/Menu.htm">Tray Icon Men&uuml;</a> ein, mit Ihrem eigenem Icon, Tooltip (Kurzinfo), Men&uuml;punkten und Untermen&uuml;s.
         </li>
         <li>Kommunizieren Sie mit Hilfe von <a href="docs/commands/MsgBox.htm">Dialogfeldern</a>, <a href="docs/commands/ToolTip.htm">Tooltips</a>, <a href="docs/commands/TrayTip.htm">Balloon Tips</a> (eingeblendete Sprechblasen) und <a href="docs/commands/Menu.htm">Popup-Men&uuml;s</a> mit dem Benutzer.
         </li>
         <li>Lassen Sie Ihr Skript automatisch - als <a href="docs/commands/OnExit.htm#logoff">Reaktion</a> auf das Herunterfahren oder Abmelden des Systems - Funktionen durchf&uuml;hren.
         </li>
         <li>Ermitteln Sie, wie lange der Benutzer <a href="docs/Variables.htm#TimeIdle">inaktiv</a> war. F&uuml;hren Sie z. B. rechenintensive Arbeiten nur dann durch, wenn der Benutzer nicht am PC arbeitet.
         </li>
         <li>Automatisieren Sie Spielaktionen durch das Erkennen von <a href="docs/commands/ImageSearch.htm">Bildern</a> und <a href="docs/commands/PixelGetColor.htm">Pixelfarben</a> (gedacht f&uuml;r legalen Gebrauch wie die Linderung des RSI-Syndroms).
         </li>
         <li>
           <a href="docs/commands/LoopReadFile.htm">Lesen</a>, <a href="docs/commands/FileAppend.htm">schreiben</a> und <a href="docs/commands/LoopParse.htm">analysieren</a> Sie Textdateien, einfacher als in anderen Programmiersprachen.
         </li>
         <li>Bearbeiten Sie Dateigruppen, die einem <a href="docs/commands/LoopFile.htm">Wildcardmuster</a> (z. B. *.txt) entsprechen.
         </li>
         <li>Arbeiten Sie mit der <a href="docs/commands/RegRead.htm">Registry</a> und <a href="docs/commands/IniRead.htm">INI-Dateien</a>.
         </li>
       </ul>
       <p>
         &nbsp;
       </p>
       <p>
         <strong>Lizenz</strong>: <a href="docs/license.htm">GNU General Public License</a>
       </p>
     </div>
     <div id="footer">
       <hr>
       <p>
         Hauptseite | <a href="download/index.htm">Download</a> | <a href="docs/Overview.htm">Dokumentation</a> | <a href="docs/AHKL_ChangeLog.htm">Changelog</a> | <a href="support/index.htm">Support</a> | <a href="forum/">Forum</a>
       </p>
     </div>
   </div>
</body></html>