<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>InputBox</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>InputBox</h1>

<p>Zeigt ein Fenster zur Eingabe eines Strings an.</p>

<pre class="Syntax">InputBox, Ausgabevariable [, Titel, Anzeigetext, Optionen, Standardwert]</pre>
<h3>Parameter</h3>
<dl>
  
    <dt>Ausgabevariable</dt>
    <dd><p>Der Name der Variable, in der der eingegebene Text des Benutzers gespeichert wird.</p></dd>
 
    <dt>Titel</dt>
    <dd><p>Der Titel der InputBox. Wenn leer oder nicht vorhanden, dann wird standardm&auml;&szlig;ig der aktuelle Name des Scripts verwendet. </p></dd>
 
    <dt>Anzeigetext</dt>
    <dd><p>Text des Eingabefensters, der darauf hinweist, was eingegeben werden soll. Wenn der <em>Anzeigetext</em> lang ist, dann kann die Liste in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), die die Lesbarkeit und Wartbarkeit verbessern k&ouml;nnten.</p></dd>
  
    <dt>Optionen</dt>
    <dd><p>Ein String mit Optionen, die durch Leer- oder Tabulatorzeichen getrennt werden m&uuml;ssen und unabh&auml;ngig von der Gro&szlig;- und Kleinschreibung sind:</p>
      <p><strong>Xn Yn:</strong> Die X- und Y-Koordinaten des Dialogfensters. Zum Beispiel wird mit <em>X0 Y0</em> das Fenster in die linken oberen Ecke des Desktops verschoben. Wenn einer der Koordinaten weggelassen wird, wird das Fenster in dieser Abmessung zentriert. Jede Koordinate kann negativ sein, um das Fenster teilweise oder vollst&auml;ndig au&szlig;erhalb des Bildschirms zu positionieren (oder auf einem zweiten Monitor, falls mehrere Monitore aktiv sind).</p>
      <p><strong>Wn Hn:</strong> Die Breite und H&ouml;he des Dialogfensters. Zum Beispiel ist <em>W375 H189</em> die Standardgr&ouml;&szlig;e.</p>
      <p><strong>T:</strong> Die Zeit&uuml;berschreitung in Sekunden. Zum Beispiel wird sie mit <em>T10.0</em> auf 10 Sekunden gesetzt. Wenn dieser Wert 2147483 (24.8 Tage) &uuml;berschreitet, wird dieser auf 2147483 gesetzt. Wenn die Zeit abgelaufen ist, wird das Dialogfenster automatisch geschlossen und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 2 gesetzt. Die <em>Ausgabevariable</em> enth&auml;lt weiterhin die Eingabe des Benutzers.</p>
      <p><strong>Password:</strong> Maskiert die Benutzereingabe. Mit dem folgenden Beispiel kann das Zeichen daf&uuml;r bestimmt werden: <em>Password*</em> <br></p></dd>
  
    <dt>Standardwert</dt>
    <dd><p>Ein String, der anf&auml;nglich im Edit-Feld des Eingabefensters erscheint. Der Benutzer kann den String z. B. mit der R&uuml;cktaste &auml;ndern. </p></dd>
  
</dl>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Siehe unten.</p>
<h3>Bemerkungen</h3>
<p>Das Fenster erlaubt dem Benutzer, einen Text einzugeben und auf die Schaltfl&auml;chen OK oder ABBRECHEN zu dr&uuml;cken. Der Benutzer kann das Fenster durch das Ziehen der Rahmen skalieren.</p>
<p>Sobald der Benutzer die Schaltfl&auml;che ABBRECHEN dr&uuml;ckt, wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt (oder auf 0 bei der Schaltfl&auml;che OK) und in der <em>Ausgabevariable</em> der Eingabewert gespeichert. Dadurch kann die ABBRECHEN-Schaltfl&auml;che nebenbei eine andere Funktion ausf&uuml;hren, wenn es gew&uuml;nscht ist.</p>
<p>Wenn die Wartezeit des Fensters abl&auml;uft, wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 2 gesetzt.<br></p>
<p>Ein GUI-Fenster kann eine modale InputBox mittels <a href="Gui.htm#OwnDialogs">Gui, +OwnDialogs</a> anzeigen. Eine modale InputBox hindert den Benutzer solange daran, mit dem GUI-Fenster zu interagieren, bis die InputBox wieder geschlossen wird.</p>
<h3>Verwandte Befehle</h3>
<p><a href="Gui.htm">GUI</a>, <a href="Input.htm">Input</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="FileSelectFile.htm">FileSelectFile</a>, <a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="ToolTip.htm">ToolTip</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">InputBox, Passwort, Passwort eingeben, (die Eingabe wird versteckt), password
InputBox, Benutzereingabe, Telefonnummer, Bitte geben sie eine Telefonnummer ein., w640 h480
If ErrorLevel
    MsgBox, ABBRECHEN wurde gedr&uuml;ckt.
Else
    MsgBox, Sie haben "%Benutzereingabe%" eingegeben.</pre>
</body></html>